zouxiaobang/ai_manager/firmware-ai-dog/sdkconfig.defaults.esp32c3
# ESP32-C3：supermini-c3（4MB Flash，无 PSRAM，SSD1306 OLED）
CONFIG_IDF_TARGET="esp32c3"
CONFIG_BOARD_SUPERMINI_C3=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
